app/views/todo_list_categories/show.html.erb

<h2>现有事项</h2>
<% @todo_list_category.todo_list_items.each do |item| %>
---
SELECT "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_category_id" = ?  [["todo_list_category_id", 9]]