app/controllers/todo_list_categories_controller.rb

  def create
    aTemp = params[:todo_list_category].permit(:name)
    @todo_list_category = TodoListCategory.new(aTemp)
    @todo_list_category.user_id = current_user.id
    if @todo_list_category.save
---
INSERT INTO "todo_list_categories" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 26 Oct 2013 23:34:21 UTC +00:00], ["name", "阿斯顿发锁打算"], ["updated_at", Sat, 26 Oct 2013 23:34:21 UTC +00:00], ["user_id", 1]]

  def show
    @todo_list_category = TodoListCategory.find(params[:id])
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "7"]]

  def destroy
    @todo_list_category = TodoListCategory.find(params[:id])
    @todo_list_category.destroy
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ?  [["id", 1]]

  def index
    @todo_list_category = TodoListCategory.new
    @todo_list_categories = TodoListCategory.where(
                   "user_id='#{current_user.id}'")
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE (user_id='1')

  def edit
    @todo_list_category = TodoListCategory.find(params[:id])
    @todo_list_categories = TodoListCategory.all
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "todo_list_categories".* FROM "todo_list_categories"

  def update
    @todo_list_category = TodoListCategory.find(params[:id])

    if @todo_list_category.update(params[:todo_list_category].permit(:name))
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "todo_list_categories" SET "name" = ?, "updated_at" = ? WHERE "todo_list_categories"."id" = 15  [["name", "第三代2"], ["updated_at", Sat, 26 Oct 2013 01:31:58 UTC +00:00]]