app/controllers/todo_list_items_controller.rb

  def create
    @todo_list_category = TodoListCategory.find(params[:todo_list_category_id])
    @todo_list_item = @todo_list_category.todo_list_items.create(
                          params[:todo_list_item].permit(:name, :content, :done))
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "todo_list_items" ("content", "created_at", "name", "todo_list_category_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", Sat, 26 Oct 2013 02:34:05 UTC +00:00], ["name", "打扫卫生"], ["todo_list_category_id", 9], ["updated_at", Sat, 26 Oct 2013 02:34:05 UTC +00:00]]

  def destroy
    @todo_list_category = TodoListCategory.find(params[:todo_list_category_id])
    @todo_list_item = @todo_list_category.todo_list_items.find(params[:id])
    @todo_list_item.destroy
---
SELECT "todo_list_categories".* FROM "todo_list_categories" WHERE "todo_list_categories"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "todo_list_items".* FROM "todo_list_items" WHERE "todo_list_items"."todo_list_category_id" = ? AND "todo_list_items"."id" = ? LIMIT 1  [["todo_list_category_id", 9], ["id", "1"]]
DELETE FROM "todo_list_items" WHERE "todo_list_items"."id" = ?  [["id", 1]]